{
    "name": "Rohan Shrotri",
    "title": "Full Stack Web Developer",
    "description": "Full stack developer specializing in Node, MongoDB and Express looking for a new software development opportunity. Currently employed as an IT professional with three years of experience in a corporate environment. Additional programming experience is with C/C++, Python and JavaScript. ",
    "bio": "Hello. I am an Information Technology professional that has spent the past six months studying web development. During my three years in industry, I have come to the realization that I am not satisfied with the way my career has been progressing and have been looking to make a change towards something I can do for the forseeable future. I have been programming in some capacity for my entire adult life, first starting with C++ and python many years ago in my community college days and focusing on the web development side more recently. Much of my programming knowledge has been self taught, so I believe I have the capacity required to learn any new skills I may need and provide value to your organization",
    "address": "San Jose, California",
    "phone_number": "",
    "email": "rohan.shrotri@outlook.com",
    "links": [
        {
            "github": "https://github.com/MoistSadness"
        },
        {
            "linkedin": "https://www.linkedin.com/in/rohan-shrotri-0711b7137/"
        }
    ],
    "education": [
        {
            "degree_name": "Cell/Molecular Biology",
            "degree_type": "B.S.",
            "minor_name": "Chemistry",
            "school": "Humboldt State University",
            "location": "Arcata, CA",
            "start_date": "August 2016",
            "end_date": "December 2018"
        },
        {
            "degree_name": "Systems Programming",
            "degree_type": "A.S.",
            "minor_name": "",
            "school": "De Anza College",
            "location": "Cupertino, CA",
            "start_date": "January 2019",
            "end_date": "Current"
        }
    ],
    "professional_experience": [
        {
            "title": "Datacenter Technician",
            "company": "IBM Cloud",
            "location": "Santa Clara, CA",
            "start_date": "August 2020",
            "end_date": "Current",
            "details": [
                "Demonstrated general knowledge proficiency with computing and telecommunications equipment.",
                "Deployed inventoried and maintained systems availability for servers and networking equipment in a datacenter of over 10,000 devices.",
                "Installed rails, fiber, cat5/cat6 copper cabling, servers and switches with accurate labeling, color coding and documentation to meet quality standards.",
                "Provided hands on support to customers, offsite networking and systems teams within IBM SLA.",
                "Displayed a high level of self-sufficiency by performing all critical datacenter operations solo."
            ]
        },
        {
            "title": "Service Desk Technician",
            "company": "Pharmacyclics, an Abbbie company",
            "location": "Sunnyvale, CA",
            "start_date": "April 2019",
            "end_date": "April 2020",
            "details": [
                "Provided level 1 support for all hardware and software issues directly affecting end users including company PCs, printers and mobile phones",
                "Displayed proficiency in troubleshooting and technical problems solving by fixing undocumented errors.",
                "Consolidated new hire onboarding and PC build process, performed fault diagnosis of faulty systems, and the management of open tickets in company ticketing system.",
                "Demonstrated friendly yet professional demeanor when interacting with customers both in person and on the phone.",
                "Procured and managed inventory of IT/Company equipment"
            ]
        }
    ],
    "skills": [
        {
            "programming_languages": [
                "C",
                "C++",
                "Java",
                "Python",
                "HTML",
                "CSS",
                "JavaScript"
            ],
            "programming_technologies": [
                "Node.js",
                "Git",
                "Bootstrap",
                "Bulma",
                "Express",
                "MERN",
                "MEAN",
                "Mongo DB",
                "Mongoose"
            ],
            "certificates": [
                "CompTIA Network+ (in progress)",
                "Python"
            ],
            "etc": [
                "Microsoft Office 365",
                "Adobe Creative Cloud",
                "Active Directory"
            ]
        }
    ],
    "portfolio": [
        {
            "id": "0",
            "title": "This Website",
            "short_description": "My Portfolio Website",
            "description": "This is my portfolio website. My interest lies mostly on the backend, so I relied heavily on resources such as bootstrap and google fonts.",
            "screenshots": [
                "../Img/Portfolio.png"
            ],
            "repository": "https://github.com/MoistSadness/Portfolio-2022",
            "skills_used": [
                "HTML", "CSS", "Javascript", "Bootstrap", "Node", "Express"
            ]
        },
        {
            "id": "1",
            "title": "YelpCamp",
            "short_description": "A Yelp Clone for viewing and rating campsites",
            "description": "I created this full production application as part of the online web development bootcamp I participated in. I implemented all sorts of things for this website, including things such as a mongo database to store data, user authentication, authorization and some security. Projects like this are what prove my skill when working with websites and why I would be a better employment candidate over the majority of my peers.",
            "screenshots": [
                "../Img/YelpCamp_1.png",
                "../Img/YelpCamp_2.png",
                "../Img/YelpCamp_3.png",
                "../Img/YelpCamp_4.png"
            ],
            "repository": "https://github.com/MoistSadness/YelpCamp",
            "skills_used": [
                "HTML", "CSS", "Javascript", "Bootstrap", "Node", "Express", "MongoDB", "Mongoose"
            ]
        },
        {
            "id": "2",
            "title": "Ping Pong Scorekeeper",
            "short_description": "A web application to keep score for anything, really",
            "description": "A scorekeeping application that I created to get some practice working with Documentation for a technologi I didnt know how to use as well as event handlers",
            "screenshots": [
                "../Img/PingPongScorekeeper.png"
            ],
            "repository": "https://github.com/MoistSadness/PingPongScorekeeper_webdev",
            "skills_used": [
                "HTML", "CSS", "Javascript", "Bulma"
            ]
        },
        {
            "id": "3",
            "title": "Used Car finder",
            "short_description": "Scrape craigslist to find used cars of a specific make and model",
            "description": "At around the start of 2022, I was interested in purchasing a nice used 4x4 SUV (that I ended up not buying). The process of manually looking up 4Runners and Sequoias on Craigslist was incredibly time consuming, so I decided to automate the process. This python script uses an external JSON file that contains a list of vehicles with search parameters such as make, model, price, year, etc... This project was what got me interested in web development to begin with.",
            "screenshots": [
                "../Img/Used_car_searcher.png"
            ],
            "repository": "https://github.com/MoistSadness/Used-Car-Finder",
            "skills_used": [
                "Python", "CSS", "Javascript", "Beautiful Soup"
            ]
        },
	{
            "id": "4",
            "title": "Image Upload API",
            "short_description": "Upload an image to a server",
            "description": "My goal is to create a website dedicated to storing photos of my favorite characters. In order to do so, I needed to learn how image upload works and how to manage the images once stored. I decided to do the project in Flask to spice things up and learn something new in the process",
            "screenshots": [
                "../Img/Image_upload_cropped.png"
            ],
            "repository": "https://github.com/MoistSadness/Image-Library-API-Flask-V1",
            "skills_used": [
                "Flask", "Python", "CSS", "HTML", "SQLite"
            ]
        }
    ]
}